class Product {
  final int? id, price;
  final String? title, subtitle, descrption, image;

  Product(
      {this.id,
      this.price,
      this.descrption,
      this.image,
      this.subtitle,
      this.title});
}

//list of product
List<Product> product = [
  Product(
      id: 1,
      price: 69,
      title: 'سماعة لاسلكية',
      subtitle: 'تمتلك جودة صوت عالية',
      descrption:
          'تمتاز سماعة بادز إير 2 نيو ببطارية ضخمة تصل سعتها إلى 480 مللي أمبير، ما يوفر 3 ساعات عمل عند الشحن لمدة 10 دقائق فقط، '),
  Product(
      id: 2,
      price: 1500,
      title: 'جهاز سامسونج A72',
      subtitle: ' جودة عالية ',
      descrption:
          'كيف تستفيد مصر من تصنيع الموبايل محليا بدلاً من الاستيراد؟ ... لخطوط الإنتاج الحالية هو تجميع 150 ألف جهاز شهرياً، وتدرس الشركة زيادتها '),
  Product(
      id: 3,
      price: 1000,
      title: 'نظارة طبية ',
      subtitle: ' جودة جيدة لاعطاء النظر افضل ',
      descrption:
          'البصر مفتاح البصيرة، والعين بوابة القلب – كما يقول الشعراء. ويبدو أن أجيال عصرنا عاجزة عن اكتساب العلم والسير في دروب العمل والحياة بدون نظارات صارت الشركات'),
  Product(
      id: 4,
      price: 100,
      title: ' راس شاحن  ',
      subtitle: ' جودة اصلية  ',
      descrption:
          'تأتي معظم الهواتف الذكية مزودة ببطاريات ليثيوم أيون ستستنفد بعد 400 إلى 500 دورة شحن، وتكتمل دورة شحن واحدة لبطاريتك بعد أن تستهلك 100% من سعتها. ومع ذلك، لا يلزم نفاد سعة البطارية بنسبة 100% من 100% '),
  Product(
      id: 5,
      price: 100,
      title: '  فرشاة اسنان  ',
      subtitle: '  جودة اصلية ممتازة  ',
      descrption:
          'ي الأطباء بغسل الأسنان مرتين يوميًا بشكل لطيف للوقاية من الإصابة بالتسوس والكسر، لكن يجب العلم أن الفم بيئة خصبة لنمو أنواع مختلفة من البكتيريا والجراثيم والفيروسات الموجودة على اللسان واللعاب واللثة.'),
];
